Repository: reacher1130/secretflow
Catalog: docs/locales/*/LC_MESSAGES/user_guide/mpc_*/generalized_linear_model.po
Languages: ml

source: Generalized Linear Models
ml: 广义线性模型

source: A Generalized Linear Model (GLM) is a flexible generalization of ordinary linear regression that allows for the response variable to have a non-normal distribution.GLMs are used to model a response variable that is a function of several explanatory variables. The general framework of GLMs is designed to handle various types of response data including continuous, binary, count, and other types of data that do not necessarily follow a normal distribution.
ml: 广义线性模型（GLM）是普通线性回归的灵活推广，允许响应变量具有非正态分布。GLM用于对响应变量进行建模，该响应变量是几个解释变量的函数。GLM的一般框架旨在处理包括连续型、二元型、计数型以及其他不一定遵循正态分布的各种类型的响应数据。

source: The key components of a GLM are:
ml: GLM的关键组成部分有：

source: Random Component: This specifies the probability distribution of the response variable (Y). Common distributions include normal (Gaussian) for continuous data, binomial for binary or proportion data, and Poisson for count data. However, GLMs can accommodate a variety of other distributions that are part of the exponential family, such as gamma and inverse Gaussian.
ml: 随机分量：这指定了响应变量（Y）的概率分布。常见的分布包括连续数据的正态（高斯）分布、二元或比例数据的二项分布和计数数据的泊松分布。然而，GLM还可以适用于指数族的其他多种分布，例如伽马分布和逆高斯分布。

source: Systematic Component: This is the linear combination of the explanatory variables (X1, X2, ..., Xn) associated with their coefficients (β1, β2, ..., βn), which we denote as η (eta). In a simple linear regression, this would just be β0 + β1X1 + β2X2 + ... + βnXn.
ml: 系统分量：这是与其系数（β1、β2、...、βn）相关的解释变量（X1、X2、...、Xn）的线性组合，我们将其表示为η（eta）。在简单线性回归中，这将是β0 + β1X1 + β2X2 + ... + βnXn。

source: Link Function: The link function provides the relationship between the linear predictor (η) and the expected value (mean) of the response variable. It is a function that maps the expected value of the response variable to the linear predictor. The choice of the link function depends on the type of the response variable. For example, the identity link (η = μ) is typically used for normal responses, the logit link (log(μ/(1-μ)) = η) for binomial responses, and the log link (log(μ) = η) for Poisson responses.
ml: 链接函数：链接函数提供了线性预测器（η）与响应变量的期望值（均值）之间的关系。它是一个将响应变量的期望值映射到线性预测器的函数。链接函数的选择取决于响应变量的类型。例如，身份链接（η = μ）通常用于正态响应，logit 链接（log(μ/(1-μ)) = η）用于二项响应，对数链接（log(μ) = η）用于泊松响应。

source: The GLM fitting process involves estimating the coefficients (β) that best explain the relationship between the predictors and the response variable. This estimation is typically done using maximum likelihood estimation, rather than the least squares estimation used in ordinary linear regression.
ml: GLM拟合过程涉及估计最能解释预测变量和响应变量之间关系的系数（β）。这种估计通常使用最大似然估计，而不是普通线性回归中使用的最小二乘估计。

source: The GLM framework also provides tools for hypothesis testing. This allows researchers to test if certain predictors have a statistically significant effect on the response variable.
ml: GLM框架还提供了用于假设检验的工具。这允许研究人员测试某些预测变量是否对响应变量有统计学上显著的影响。

source: Finally, GLMs include diagnostic measures, such as deviance residuals, to assess the adequacy and fit of the model. Deviance residuals can be used to identify outliers or points that have a high influence on the model fit, and they help in determining whether the chosen model and link function are appropriate for the data.
ml: 最后，GLM包括诊断措施，如偏差残差，以评估模型的充分性和拟合度。偏差残差可用于识别异常值或对模型拟合有较大影响的点，并且它们有助于确定所选模型和链接函数是否适合数据。

source: In summary, GLMs extend linear regression by allowing for response variables that have different distributions and by using link functions to relate the response variable to the linear predictors. This makes GLMs a powerful and flexible tool in statistical modeling for various types of data.
ml: 总之，GLM通过允许响应变量具有不同的分布并使用链接函数将响应变量与线性预测器相关联来扩展线性回归。这使得GLM成为统计建模中处理各种类型数据的强大且灵活的工具。

source: Under the protection of a multi-party secure computing protocol, SecretFlow implements secure GLM algorithm for vertically partitioned dataset setting.
ml: 在多方安全计算协议的保护下，SecretFlow实现了用于垂直划分数据集设置的安全GLM算法。

source: SecretFlow provides one secure implementation of GLM:
ml: SecretFlow提供了一种安全的GLM实现：

source: SS-GLM: SS-GLM is short for secret sharing Generalized Linear Model.
ml: SS-GLM：SS-GLM是秘密共享广义线性模型的简称。

source: Secret Sharing is sensitive to bandwidth and latency.
ml: 秘密共享对带宽和延迟敏感。

source: Secret Sharing can complete the modeling faster with LAN or 10 Gigabit network, and with limited bandwidth and high latency network environment can use HE to improve the modeling speed.
ml: 秘密共享可以在局域网或10吉比特网络下更快地完成建模，在带宽有限和网络延迟高的环境下可以使用同态加密（HE）来提高建模速度。

source: The SS-GLM module :py:meth:`~secretflow.ml.linear.ss_glm.model.SSGLM` provides both linear and logistic regression linear models for vertical split dataset setting by using secret sharing. Two solvers are availbale, one is mini batch SGD training solver, and another is iterated reweighted least squares (IRLS) sovler.
ml: SS-GLM模块 :py:meth:`~secretflow.ml.linear.ss_glm.model.SSGLM` 通过使用秘密共享为垂直划分数据集设置提供线性回归和逻辑回归线性模型。提供两种求解器，一种是小批量SGD训练求解器，另一种是迭代重加权最小二乘法（IRLS）求解器。

source: For more detailed examples, checkout the tutorial or unit tests in secretflow source code.
ml: 有关更详细的示例，请查看secretflow源代码中的教程或单元测试。

source: Tutorial
ml: 教程
